{
  "title": "History of Computers",
  "sections": [
    {
      "type": "section",
      "title": "What is a Computer?",
      "content": [
        { "type": "paragraph", "text": "The word \"computer\" originally referred to a person who performed calculations. Before electronic machines, human computers were employed to solve complex mathematical problems, especially during wartime for calculating artillery trajectories and breaking enemy codes." },
        { "type": "paragraph", "text": "Today, we define a computer as an electronic device that can store, retrieve, and process data according to a set of instructions called a program." }
      ]
    },
    {
      "type": "section",
      "title": "Evolution of Computing Devices",
      "content": [
        { "type": "heading", "level": 3, "text": "1. Ancient Calculating Tools (3000 BC - 1600 AD)" },
        { "type": "image", "imageKey": "abacus", "alt": "Ancient abacus", "caption": "The abacus: one of the earliest calculating devices, still used today" },
        { "type": "paragraph", "text": "The journey began with simple counting tools like the abacus, invented around 3000 BC. These mechanical devices helped humans perform basic arithmetic operations much faster than mental calculation alone." },

        { "type": "heading", "level": 3, "text": "2. Mechanical Computers (1600s - 1800s)" },
        { "type": "image", "imageKey": "analytical_engine", "alt": "Analytical Engine schematic", "caption": "Charles Babbage's Analytical Engine - the first design for a general-purpose computer" },
        { "type": "paragraph", "text": "Charles Babbage designed the Analytical Engine in the 1830s, which is considered the first design for a general-purpose computer. It included all the basic elements of a modern computer: input devices, memory, a central processing unit, and output devices." },

        { "type": "heading", "level": 3, "text": "3. Electromechanical Era (1930s - 1940s)" },
        { "type": "paragraph", "text": "The 1930s saw the development of electromechanical computers that used electrical switches and mechanical relays. These machines could perform calculations much faster than purely mechanical devices." },

        { "type": "heading", "level": 3, "text": "4. Electronic Computers (1940s - 1950s)" },
        { "type": "image", "imageKey": "eniac", "alt": "ENIAC computer", "caption": "ENIAC (1946) - one of the first general-purpose electronic computers" },
        { "type": "paragraph", "text": "ENIAC (Electronic Numerical Integrator and Computer), completed in 1946, was one of the first general-purpose electronic computers. It weighed 30 tons, occupied 1,800 square feet, and used 18,000 vacuum tubes." },

        { "type": "heading", "level": 3, "text": "5. Transistor Revolution (1950s - 1960s)" },
        { "type": "image", "imageKey": "transistor_computer", "alt": "Transistor symbol", "caption": "The transistor replaced vacuum tubes, making computers smaller and more reliable" },
        { "type": "paragraph", "text": "The invention of the transistor in 1947 revolutionized computing. Transistors were smaller, more reliable, and consumed less power than vacuum tubes, leading to the second generation of computers." },

        { "type": "heading", "level": 3, "text": "6. Integrated Circuits and Microprocessors (1960s - Present)" },
        { "type": "image", "imageKey": "microprocessor", "alt": "Microprocessor chip", "caption": "Modern microprocessors contain billions of transistors on a single chip" },
        { "type": "paragraph", "text": "The development of integrated circuits (microchips) in the 1960s and microprocessors in the 1970s led to personal computers. Today's smartphones have more computing power than the room-sized computers of the 1940s." }
      ]
    },
    {
      "type": "section",
      "title": "Computing Operations: Input → Processing → Output",
      "content": [
        { "type": "image", "imageKey": "ipo_diagram", "alt": "Input-Processing-Output diagram", "caption": "The IPO model: input → processing → output" },
        { "type": "paragraph", "text": "Old definition: In early computing, an 'operation' meant a basic arithmetic or tabulation step carried out by people or electromechanical devices. Each operation was a single manual/mechanical action like adding, subtracting, or moving values on a register." },
        { "type": "paragraph", "text": "Current definition: In modern computing, an operation is any transformation a computer performs on data under program control — arithmetic, logic, data movement, storage, and retrieval. Operations are executed as CPU instructions, orchestrated by algorithms." },
        { "type": "paragraph", "text": "These operations are best understood through the IPO concept:" },
        { "type": "list", "ordered": false, "items": [
          "Input: Data enters the system (keyboard, sensors, files, network).",
          "Processing: The CPU executes instructions to transform the input using algorithms.",
          "Output: The results are presented or stored (screen, sound, files, databases)."
        ] }
      ]
    },
    {
      "type": "keypoints",
      "points": [
        "The word 'computer' originally referred to people who performed calculations",
        "Computing evolved from mechanical devices (abacus) to electronic machines",
        "Key milestones: Analytical Engine (1830s), ENIAC (1946), transistor (1947), microprocessor (1970s)",
        "Each generation became smaller, faster, and more powerful",
        "Modern computers can perform billions of operations per second"
      ]
    },
    {
      "type": "example",
      "title": "Computing Power Comparison",
      "content": [
        { "type": "paragraph", "text": "ENIAC (1946): 5,000 operations per second, 30 tons, room-sized" },
        { "type": "paragraph", "text": "Modern smartphone: Billions of operations per second, 200 grams, pocket-sized" },
        { "type": "paragraph", "text": "Your phone is literally millions of times more powerful than the computers that helped win World War II!" }
      ]
    }
  ]
}